       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.
      *Meu primeiro programa

       PROGRAM-BEGIN.
           DISPLAY 'Hello World'.

       PROGRAM-DONE.
           STOP RUN.
