       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG7.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           DISPLAY "Quem Olha para fora sonha e quem olha para dentro"
      -     "acorda. Carl Gustav Jung Criador da Psicologia Analítica".
