      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       SPECIAL-NAMES.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       I-O-CONTROL.

       DATA DIVISION.


       FILE SECTION.
       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world!"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
