      *=================================================================
       IDENTIFICATION                                  DIVISION.
      *=================================================================
       PROGRAM-ID. Variaveis-1.
      *******************************************************************
      * Author: Vinícius Azevedo
      * Date: 10/04/2020
      * Purpose: Acadêmico
      * Tectonics: cobc
      ******************************************************************
      *=================================================================
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                           SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.

      *-----------------------------------------------------------------
       INPUT-OUTPUT                            SECTION.
      *-----------------------------------------------------------------

       FILE-CONTROL.

      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                         SECTION.
      *-----------------------------------------------------------------
      *<NIVEL> <IDENTIFICADOR> <TIPO(TAMANHO)>
       77  NUMEROX         PIC 9(18).
      *A VARIAVEL VEM COM O SINAL DE MAIS.
       77  NUMEROX-SINAL   PIC S9(18).
      *VARIAVEL COM DECIMAL, EX: 10,02 - ONDE O V = VIRGULA.
       77  NUMEROX-DECIMAL PIC 9(02)V9(02).
       77  NUMEROX-DECIMAL PIC 9(02)V99.
      *VARIAVEL ALFABÉTICA
       77  ALFABETICOX     PIC A(20).
      *VARIAVEL ALFANUMERICA
       77  ALFANUMERX      PIC X(30).

      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
