      *=================================================================
       IDENTIFICATION                                  DIVISION.
      *=================================================================
       PROGRAM-ID. Condição-de-Sinal.
      *******************************************************************
      * Author: Vinícius Azevedo
      * Date: 13/04/2020
      * Purpose: Acadêmico
      * Tectonics: cobc
      ******************************************************************
      *=================================================================
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                           SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.

      *-----------------------------------------------------------------
       INPUT-OUTPUT                            SECTION.
      *-----------------------------------------------------------------

       FILE-CONTROL.

      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                         SECTION.
      *-----------------------------------------------------------------
       77 WRK-VALOR             PIC S9(10) VALUE ZEROS.
       77 WRK-VALOR2            PIC 9(10) VALUE 1.
       77 WRK-VALOR3            PIC 9(10) VALUE 0.




      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
      *VALIDANDO SE A VAR É POSITIVA
           IF WRK-VALOR2 IS POSITIVE
               DISPLAY WRK-VALOR2
           END-IF.

      *VALIDANDO SE A VAR É ZERO
           IF WRK-VALOR3 IS ZERO
               DISPLAY WRK-VALOR3
           END-IF.

      *VALIDANDO SE A VAR É NEGATIVA
           MOVE -1 TO WRK-VALOR
           IF WRK-VALOR IS NEGATIVE
               DISPLAY WRK-VALOR
           END-IF

           STOP RUN.
