      *=================================================================
       IDENTIFICATION                                  DIVISION.
      *=================================================================
       PROGRAM-ID. IF-ELSE-ENDIF.
      *******************************************************************
      * Author: Vinícius Azevedo
      * Date: 13/04/2020
      * Purpose: Acadêmico
      * Tectonics: cobc
      ******************************************************************
      *=================================================================
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                           SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.

      *-----------------------------------------------------------------
       INPUT-OUTPUT                            SECTION.
      *-----------------------------------------------------------------

       FILE-CONTROL.

      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                         SECTION.
      *-----------------------------------------------------------------

      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
      *SINTAXES BÁSICAS PARA USAR O COMANDO IF

           IF <CONDIÇÃO>
              <INSTRUÇÃO>
           END-IF.

               IF <CONDIÇÃO>
                   <INSTRUÇÃO>
               ELSE
                   <INSTRUÇÃO>
               END-IF.
