       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG7.
      *programas que demonstra o uso continuo de um texto na linha/baixo
       ENVIRONMENT DIVISION.
       DATA DIVISION.


       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           DISPLAY 'Quem olha para fora sonha e quem olha para dentro '
      -    'acorda. Carl Gustav Jung'.

       PROGRAM-DONE.
           STOP-RUN.
