      *=================================================================
       IDENTIFICATION                                  DIVISION.
      *=================================================================
       PROGRAM-ID. Variaveis-2.
      *******************************************************************
      * Author: Vinícius Azevedo
      * Date: 10/04/2020
      * Purpose: Acadêmico
      * Tectonics: cobc
      ******************************************************************
      *=================================================================
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                           SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.

      *-----------------------------------------------------------------
       INPUT-OUTPUT                            SECTION.
      *-----------------------------------------------------------------

       FILE-CONTROL.

      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                         SECTION.
      *-----------------------------------------------------------------
      *01 = NUMERAÇÃO USADA PARA REGISTRO
      *TODOS OS REGISTROS SÃO ALFANUMERICOS
      *ITENS ELEMENTARES PODEM RECEBER NUM DE 02 A 49
       01 CLIENTE.
           02 NOME      PIC X(20) VALUE 'VINICIUS AZEVEDO'.
           02 RG        PIC X(11) VALUE '00000000000'.
           02 CPF       PIC X(11) VALUE '11111111111'.
           02 ENDERECO  PIC X(20) VALUE 'RUA X07075'.
           02 DATANASC.
               03 DIA  PIC X(02) VALUE '11'.
               03 MES  PIC X(02) VALUE '02'.
               03 ANO  PIC X(04) VALUE '1992'.


      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           DISPLAY CLIENTE.
           STOP RUN.
