       FD  STUDENT.
       01  STUDENT-FILE.
           05  STUDENT-ID           PIC 9(5).
           05  FILLER               PIC X(1).
           05  STUDENT-NAME         PIC X(25).
