       IDENTIFICATION DIVISION.
       PROGRAM-ID.PROG23.
      *    INICIALIZAÇÃO DE VARIÁVEIS

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  NUMERO   PIC 99 VALUE 15.
       01  MENSAGEM PIC X(20) VALUE "CURSO DE COBOL".
      *    ZERO,ZEROS,ZEROES,
       01  NUMERO2  PIC 99 VALUE ZEROS.
      *    SPACE, SPACES
       01  TEXTO    PIC X(30) VALUE SPACES.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "NUMERO: " NUMERO.
           DISPLAY "MENSAGEM: " MENSAGEM.
           DISPLAY"-----".
           DISPLAY "NUMERO2: " NUMERO2.
           DISPLAY "TEXTO: " TEXTO.

           DISPLAY "ATRIBUINDO VALORES".
           ADD 20 TO NUMERO2.
           DISPLAY "NUMERO2: " NUMERO2.

       PROGRAM-DONE.
           STOP RUN.
