      *=================================================================
       IDENTIFICATION                                  DIVISION.
      *=================================================================
       PROGRAM-ID. ComandosAritméticos-4.
      *******************************************************************
      * Author: Vinícius Azevedo
      * Date: 12/04/2020
      * Purpose: Acadêmico
      * Tectonics: cobc
      ******************************************************************
      *=================================================================
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                           SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.

      *-----------------------------------------------------------------
       INPUT-OUTPUT                            SECTION.
      *-----------------------------------------------------------------

       FILE-CONTROL.

      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                         SECTION.
      *-----------------------------------------------------------------
      *TODO NOME DE VAR DA WORKING-STORAGE SECTION SE INICIA COM WRK
       77 WRK-VALOR             PIC 9(10) VALUE 10.
       77 WRK-VALOR2            PIC 9(10) VALUE ZEROS.




      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================

           MOVE 20 TO WRK-VALOR2.
           DISPLAY WRK-VALOR2.

           STOP RUN.
