       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.


       PROGRAM-BEGIN.
           DISPLAY "Emanuel".

       PROGRAM-DONE.
           STOP RUN.
