000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PROG1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.
      * meu primeiro programa

       PROGRAM-BEGIN.
           DISPLAY "Emanuel".

       PROGRAM-DONE.
           STOP RUN.
